# 数据处理

In [2]:
import pandas as pd 
import numpy as np

In [6]:
data = {'name':['congcong', 'mingming', 'meimei', 'lili', 'xingxing'],'age': [76, 95, 93, 92,81]}
data = pd.DataFrame(data, columns=['name','age'])
data['name'] = data['name'].apply(str.title)
data

       name  age
0  Congcong   76
1  Mingming   95
2    Meimei   93
3      Lili   92
4  Xingxing   81

In [7]:
data.dtypes

name    object
age      int64
dtype: object

In [8]:
data = {'name':['congcong', 'mingming', 'meimei', 'lili', 'xingxing'],'age': [76, '95', 93, '92',81]}
data = pd.DataFrame(data, columns=['name','age'])
data['name'] = data['name'].apply(str.title)
data

       name age
0  Congcong  76
1  Mingming  95
2    Meimei  93
3      Lili  92
4  Xingxing  81

In [9]:
data.dtypes

name    object
age     object
dtype: object

In [27]:
import numpy as np

X=np.array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11],
       [12, 13, 14],
       [15, 16, 17],
       [18, 19, 20],
       [21, 22, 23],
       [24, 25, 26],
       [27, 28, 29]])

print(X[:,2])
# 改变第三列的值为2
X[:,2]=1
data = pd.DataFrame(X,columns=['a','b','c'])
data

[ 2  5  8 11 14 17 20 23 26 29]

    a   b  c
0   0   1  1
1   3   4  1
2   6   7  1
3   9  10  1
4  12  13  1
5  15  16  1
6  18  19  1
7  21  22  1
8  24  25  1
9  27  28  1

In [28]:
from sklearn.feature_selection import VarianceThreshold

# 设置阈值，特征小于该值会被删除
vt=VarianceThreshold(threshold=3)
new_data=vt.fit_transform(data)
#输出每一列的方差
print(vt.variances_)

[74.25 74.25  0.  ]

In [26]:
new_data

array([[ 0,  1],
       [ 3,  4],
       [ 6,  7],
       [ 9, 10],
       [12, 13],
       [15, 16],
       [18, 19],
       [21, 22],
       [24, 25],
       [27, 28]])